app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Dogs"], ["created_at", "2019-09-05 11:30:26.958304"], ["updated_at", "2019-09-05 11:30:26.958304"]]

  def edit
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def update
    @category = Category.find(params[:id])

    if @category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "Nature"], ["updated_at", "2019-09-05 12:38:19.734940"], ["id", 1]]

  def show
    @category = Category.find(params[:id])
    @categories = Category.all
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"