app/controllers/images_controller.rb

INSERT INTO "images" ("image", "image_title", "image_file_size", "image_content_type", "image_description", "category_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @image = Image.new(image_params)

    if @image.save

SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 6]]
---
  def destroy
    @image = Image.find(params[:id])
    @image.destroy

SELECT "images".* FROM "images"
SELECT "categories".* FROM "categories"
---
  def index
    @images = Image.all
    @categories = Category.all