app/views/images/new.html.erb

SELECT "categories".* FROM "categories"
---
        <%= f.label :category %>
        <%= f.select :category_id, Category.all.collect {|x| [x.name, x.id]}, {:include_blank => "Select One"}, class: "form-control" %>